design_model/src/main/resources/行为型模式/状态模式/状态模式.md
```mermaid
classDiagram
    class State {
        <<Abstract>>
        +handle()*
    }
    class ConcreteStateA {
        +handle();
    }
    class ConcreteStateB {
        +handle();
    }
    class Context {
        -State state;
        +reqeust();
        ..request()..
        state.handle();
        ....
        +setState(State state);
    }
    ConcreteStateA --|> State
    ConcreteStateB --|> State
    Context o-- State : state
```
